Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FV16KM202.h
#define _DAC2CON_DACOE_POSITION                  0x00000007
#define _DAC2CON_DACOE_MASK                      0x00000080
#define _DAC2CON_DACOE_LENGTH                    0x00000001

#define _DAC2CON_DACTRIG_POSITION                0x00000008
#define _DAC2CON_DACTRIG_MASK                    0x00000100
#define _DAC2CON_DACTRIG_LENGTH                  0x00000001

#define _DAC2CON_SRDIS_POSITION                  0x00000009
#define _DAC2CON_SRDIS_MASK                      0x00000200
#define _DAC2CON_SRDIS_LENGTH                    0x00000001

#define _DAC2CON_DACFM_POSITION                  0x0000000B
#define _DAC2CON_DACFM_MASK                      0x00000800
#define _DAC2CON_DACFM_LENGTH                    0x00000001

#define _DAC2CON_DACSLP_POSITION                 0x0000000C
#define _DAC2CON_DACSLP_MASK                     0x00001000
#define _DAC2CON_DACSLP_LENGTH                   0x00000001

#define _DAC2CON_DACSIDL_POSITION                0x0000000D
#define _DAC2CON_DACSIDL_MASK                    0x00002000
#define _DAC2CON_DACSIDL_LENGTH                  0x00000001

#define _DAC2CON_DACEN_POSITION                  0x0000000F
#define _DAC2CON_DACEN_MASK                      0x00008000
#define _DAC2CON_DACEN_LENGTH                    0x00000001

#define _DAC2CON_REFSEL0_POSITION                0x00000000
#define _DAC2CON_REFSEL0_MASK                    0x00000001
#define _DAC2CON_REFSEL0_LENGTH                  0x00000001

#define _DAC2CON_REFSEL1_POSITION                0x00000001
#define _DAC2CON_REFSEL1_MASK                    0x00000002
#define _DAC2CON_REFSEL1_LENGTH                  0x00000001

#define _DAC2CON_DACTSEL0_POSITION               0x00000002
#define _DAC2CON_DACTSEL0_MASK                   0x00000004
#define _DAC2CON_DACTSEL0_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL1_POSITION               0x00000003
#define _DAC2CON_DACTSEL1_MASK                   0x00000008
#define _DAC2CON_DACTSEL1_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL2_POSITION               0x00000004
#define _DAC2CON_DACTSEL2_MASK                   0x00000010
#define _DAC2CON_DACTSEL2_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL3_POSITION               0x00000005
#define _DAC2CON_DACTSEL3_MASK                   0x00000020
#define _DAC2CON_DACTSEL3_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL4_POSITION               0x00000006
#define _DAC2CON_DACTSEL4_MASK                   0x00000040
#define _DAC2CON_DACTSEL4_LENGTH                 0x00000001

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

#define _TRISA_TRISA3_POSITION                   0x00000003
#define _TRISA_TRISA3_MASK                       0x00000008
#define _TRISA_TRISA3_LENGTH                     0x00000001

#define _TRISA_TRISA4_POSITION                   0x00000004
#define _TRISA_TRISA4_MASK                       0x00000010
#define _TRISA_TRISA4_LENGTH                     0x00000001

#define _TRISA_TRISA7_POSITION                   0x00000007
#define _TRISA_TRISA7_MASK                       0x00000080
#define _TRISA_TRISA7_LENGTH                     0x00000001

#define _PORTA_RA0_POSITION                      0x00000000
#define _PORTA_RA0_MASK                          0x00000001
#define _PORTA_RA0_LENGTH                        0x00000001

#define _PORTA_RA1_POSITION                      0x00000001
#define _PORTA_RA1_MASK                          0x00000002
#define _PORTA_RA1_LENGTH                        0x00000001

#define _PORTA_RA2_POSITION                      0x00000002
#define _PORTA_RA2_MASK                          0x00000004
#define _PORTA_RA2_LENGTH                        0x00000001

#define _PORTA_RA3_POSITION                      0x00000003
#define _PORTA_RA3_MASK                          0x00000008
#define _PORTA_RA3_LENGTH                        0x00000001

#define _PORTA_RA4_POSITION                      0x00000004
#define _PORTA_RA4_MASK                          0x00000010
#define _PORTA_RA4_LENGTH                        0x00000001

#define _PORTA_RA5_POSITION                      0x00000005
#define _PORTA_RA5_MASK                          0x00000020
#define _PORTA_RA5_LENGTH                        0x00000001

#define _PORTA_RA7_POSITION                      0x00000007
#define _PORTA_RA7_MASK                          0x00000080
#define _PORTA_RA7_LENGTH                        0x00000001

#define _LATA_LATA0_POSITION                     0x00000000
#define _LATA_LATA0_MASK                         0x00000001
#define _LATA_LATA0_LENGTH                       0x00000001

#define _LATA_LATA1_POSITION                     0x00000001
#define _LATA_LATA1_MASK                         0x00000002
#define _LATA_LATA1_LENGTH                       0x00000001

#define _LATA_LATA2_POSITION                     0x00000002
#define _LATA_LATA2_MASK                         0x00000004
#define _LATA_LATA2_LENGTH                       0x00000001

#define _LATA_LATA3_POSITION                     0x00000003
#define _LATA_LATA3_MASK                         0x00000008
#define _LATA_LATA3_LENGTH                       0x00000001

#define _LATA_LATA4_POSITION                     0x00000004
#define _LATA_LATA4_MASK                         0x00000010
#define _LATA_LATA4_LENGTH                       0x00000001

#define _LATA_LATA7_POSITION                     0x00000007
#define _LATA_LATA7_MASK                         0x00000080
#define _LATA_LATA7_LENGTH                       0x00000001

#define _ODCA_ODA0_POSITION                      0x00000000
#define _ODCA_ODA0_MASK                          0x00000001
#define _ODCA_ODA0_LENGTH                        0x00000001

